app/controllers/products_controller.rb

SELECT  "products".* FROM "products"   ORDER BY products.created_at DESC LIMIT 25 OFFSET 0
SELECT COUNT(*) FROM "products"
---
  def index
  	@products = Product.order('products.created_at DESC').page(params[:page])

INSERT INTO "products" ("created_at", "description", "name", "price_in_cents", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", "2014-11-10 05:03:12.928823"], ["description", "hjkfs"], ["name", "fsa"], ["price_in_cents", 22], ["updated_at", "2014-11-10 05:03:12.928823"]]
---
  def create
  	@product = Product.new(product_params)

  	if @product.save