app/controllers/reviews_controller.rb

SELECT  "products".* FROM "products"  WHERE "products"."id" = ? LIMIT 1  [["id", 105]]
---
  def load_product
    @product = Product.find(params[:product_id])

INSERT INTO "reviews" ("comment", "created_at", "product_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["comment", "hgjkl"], ["created_at", "2014-12-01 19:27:11.219117"], ["product_id", 105], ["updated_at", "2014-12-01 19:27:11.219117"], ["user_id", 5]]
---
  def create
  	@review = @product.reviews.build(review_params)
  	@review.user = current_user

  	# if @review.save
  	# 	redirect_to products_path, notice: 'review created successfully'
  	# else
  	# 	render 'products/show'
  	# end

    respond_to do |format|
      if @review.save