app/views/products/_reviews.html.erb

SELECT "reviews".* FROM "reviews"  WHERE "reviews"."product_id" = ?  [["product_id", 106]]
---
<% @product.reviews.each do |review| %>

INSERT INTO "reviews" ("comment", "created_at", "product_id", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["comment", "testero"], ["created_at", "2014-12-02 03:53:48.585322"], ["product_id", 106], ["updated_at", "2014-12-02 03:53:48.585322"], ["user_id", 5]]
---
				<em> by <%= review.user.email %></em>
				Added on: <%= review.created_at %>